Revit 2024 API
ExportPDFSettings.SetOptions Method
 Sets options for exporting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public void SetOptions(
	PDFExportOptions options
)
Visual Basic
Public Sub SetOptions ( _
	options As PDFExportOptions _
)
Visual C++
public:
void SetOptions(
	PDFExportOptions^ options
)
Parameters
options
Type: Autodesk.Revit.DB.PDFExportOptions
 Other options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace